timetracking/app/views/people/show.html.erb

	<ul>
			<% @person.projects.each do |project| %>
---
SELECT  "projects".* FROM "projects" INNER JOIN "participations" ON "projects"."id" = "participations"."project_id" WHERE "participations"."person_id" = ? AND "projects"."id" = ? LIMIT 1  [["person_id", 18], ["id", 1]]