timetracking/app/controllers/entries_controller.rb

	def index
		@project = Project.find_by(id: params[:project_id])
		@date = Date.current
		@entries = @project.entries.where(date: @date.beginning_of_month.. @date.end_of_month)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 3]]
SELECT "entries".* FROM "entries" WHERE "entries"."project_id" = ? AND ("entries"."date" BETWEEN '2015-11-01' AND '2015-11-30')  [["project_id", 6]]

	def new
		@project = Project.find(params[:project_id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 6]]

	def create
		@project = Project.find(params[:project_id])
		@entry = @project.entries.new(entry_params)

		if @entry.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 6]]
INSERT INTO "entries" ("hours", "minutes", "date", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["hours", 2], ["minutes", 1], ["date", "2013-01-01 00:00:00.000000"], ["project_id", 6], ["created_at", "2015-11-18 14:04:10.073201"], ["updated_at", "2015-11-18 14:04:10.073201"]]

	def edit
		@project = Project.find(params[:project_id])
		@entry = @project.entries.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "entries".* FROM "entries" WHERE "entries"."project_id" = ? AND "entries"."id" = ? LIMIT 1  [["project_id", 5], ["id", 34]]

	def update
		@project = Project.find(params[:project_id])
		@entry = @project.entries.find(params[:id])

		if @entry.update_attributes(entry_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "entries".* FROM "entries" WHERE "entries"."project_id" = ? AND "entries"."id" = ? LIMIT 1  [["project_id", 5], ["id", 34]]
UPDATE "entries" SET "hours" = ?, "minutes" = ?, "date" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["hours", 3], ["minutes", 0], ["date", "2015-11-18 00:00:00.000000"], ["updated_at", "2015-11-18 16:29:34.141070"], ["id", 5]]

	def destroy
		@project = Project.find(params[:project_id])
		@entry = @project.entries.find(params[:id])

		@entry.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 21]]
SELECT  "entries".* FROM "entries" WHERE "entries"."project_id" = ? AND "entries"."id" = ? LIMIT 1  [["project_id", 21], ["id", 21]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 21]]