timetracking/app/controllers/people_controller.rb

	def index
		@people = Person.last_created_people(5)
			if @people.empty?
---
SELECT  "people".* FROM "people"  ORDER BY created_at DESC LIMIT 5
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "people" LIMIT 5) subquery_for_count

	def show
		@person = Person.find_by(id: params[:id])
		@projects = @person.projects
		@projects_no_associated = @person.select_non_associated_project
---
SELECT  "projects".* FROM "projects" INNER JOIN "participations" ON "projects"."id" = "participations"."project_id" WHERE "participations"."person_id" = ? AND "projects"."id" = ? LIMIT 1  [["person_id", 18], ["id", 1]]

	def update
		@project = Project.find params[:person][:projects]
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 8]]